Model Architecture Summary:
Model: "sequential"

_________________________________________________________________

 Layer (type)                Output Shape              Param #   

=================================================================

 flatten (Flatten)           (None, 784)               0         

                                                                 

 dense (Dense)               (None, 64)                50240     

                                                                 

 dense_1 (Dense)             (None, 128)               8320      

                                                                 

 dense_2 (Dense)             (None, 10)                1290      

                                                                 

=================================================================

Total params: 59850 (233.79 KB)

Trainable params: 59850 (233.79 KB)

Non-trainable params: 0 (0.00 Byte)

_________________________________________________________________

Accuracy: 0.8886

Additional Insights:
This model achieved an accuracy of 88.86% on the test data.